tests/MySQL/src/tests/scripts/latency_profiler/lite_no_des/sysbench.log
root@774e0794e9a7:/# sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --report-interval=1 --tables=1 --table-size=1000000 --threads=1 --time=10 --mysql-host=mysql-server --mysql-port=59999 --mysql-user=sbtest --mysql-password=password --db-ps-mode=disable --mysql-ignore-errors=2013,1062 --skip_trx=on run
sysbench 1.0.17 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 1 tps: 95.71 qps: 1731.75 (r/w/o: 1348.91/382.84/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 1 tps: 75.99 qps: 1375.79 (r/w/o: 1068.84/306.95/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 1 tps: 69.96 qps: 1245.23 (r/w/o: 968.40/276.83/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 1 tps: 92.91 qps: 1680.41 (r/w/o: 1308.76/371.65/0.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 1 tps: 76.98 qps: 1387.58 (r/w/o: 1079.67/307.91/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 1 tps: 97.93 qps: 1756.69 (r/w/o: 1364.99/391.71/0.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 1 tps: 73.00 qps: 1318.96 (r/w/o: 1026.97/291.99/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 1 tps: 73.00 qps: 1316.02 (r/w/o: 1024.02/292.01/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 1 tps: 66.00 qps: 1183.01 (r/w/o: 919.00/264.00/0.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 65.99 qps: 1181.91 (r/w/o: 917.93/263.98/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            11046
        write:                           3156
        other:                           0
        total:                           14202
    transactions:                        789    (78.76 per sec.)
    queries:                             14202  (1417.69 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0156s
    total number of events:              789

Latency (ms):
         min:                                    2.70
         avg:                                   12.69
         max:                                   22.02
         95th percentile:                       17.95
         sum:                                10008.55

Threads fairness:
    events (avg/stddev):           789.0000/0.00
    execution time (avg/stddev):   10.0086/0.00